espressif/esp-idf/components/soc/esp32/register/soc/mcpwm_reg.h
/** MCPWM_INT_RAW_REG register
 *  Raw interrupt status
 */
#define MCPWM_INT_RAW_REG(i) (DR_REG_MCPWM_BASE(i) + 0x114)
/** MCPWM_TIMER0_STOP_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw status bit for the interrupt triggered when the timer 0 stops.
 */
#define MCPWM_TIMER0_STOP_INT_RAW    (BIT(0))
#define MCPWM_TIMER0_STOP_INT_RAW_M  (MCPWM_TIMER0_STOP_INT_RAW_V << MCPWM_TIMER0_STOP_INT_RAW_S)
#define MCPWM_TIMER0_STOP_INT_RAW_V  0x00000001U
#define MCPWM_TIMER0_STOP_INT_RAW_S  0
/** MCPWM_TIMER1_STOP_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw status bit for the interrupt triggered when the timer 1 stops.
 */
#define MCPWM_TIMER1_STOP_INT_RAW    (BIT(1))
#define MCPWM_TIMER1_STOP_INT_RAW_M  (MCPWM_TIMER1_STOP_INT_RAW_V << MCPWM_TIMER1_STOP_INT_RAW_S)
#define MCPWM_TIMER1_STOP_INT_RAW_V  0x00000001U
#define MCPWM_TIMER1_STOP_INT_RAW_S  1
/** MCPWM_TIMER2_STOP_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw status bit for the interrupt triggered when the timer 2 stops.
 */
#define MCPWM_TIMER2_STOP_INT_RAW    (BIT(2))
#define MCPWM_TIMER2_STOP_INT_RAW_M  (MCPWM_TIMER2_STOP_INT_RAW_V << MCPWM_TIMER2_STOP_INT_RAW_S)
#define MCPWM_TIMER2_STOP_INT_RAW_V  0x00000001U
#define MCPWM_TIMER2_STOP_INT_RAW_S  2
/** MCPWM_TIMER0_TEZ_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM timer 0 TEZ event.
 */
#define MCPWM_TIMER0_TEZ_INT_RAW    (BIT(3))
#define MCPWM_TIMER0_TEZ_INT_RAW_M  (MCPWM_TIMER0_TEZ_INT_RAW_V << MCPWM_TIMER0_TEZ_INT_RAW_S)
#define MCPWM_TIMER0_TEZ_INT_RAW_V  0x00000001U
#define MCPWM_TIMER0_TEZ_INT_RAW_S  3
/** MCPWM_TIMER1_TEZ_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM timer 1 TEZ event.
 */
#define MCPWM_TIMER1_TEZ_INT_RAW    (BIT(4))
#define MCPWM_TIMER1_TEZ_INT_RAW_M  (MCPWM_TIMER1_TEZ_INT_RAW_V << MCPWM_TIMER1_TEZ_INT_RAW_S)
#define MCPWM_TIMER1_TEZ_INT_RAW_V  0x00000001U
#define MCPWM_TIMER1_TEZ_INT_RAW_S  4
/** MCPWM_TIMER2_TEZ_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM timer 2 TEZ event.
 */
#define MCPWM_TIMER2_TEZ_INT_RAW    (BIT(5))
#define MCPWM_TIMER2_TEZ_INT_RAW_M  (MCPWM_TIMER2_TEZ_INT_RAW_V << MCPWM_TIMER2_TEZ_INT_RAW_S)
#define MCPWM_TIMER2_TEZ_INT_RAW_V  0x00000001U
#define MCPWM_TIMER2_TEZ_INT_RAW_S  5
/** MCPWM_TIMER0_TEP_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM timer 0 TEP event.
 */
#define MCPWM_TIMER0_TEP_INT_RAW    (BIT(6))
#define MCPWM_TIMER0_TEP_INT_RAW_M  (MCPWM_TIMER0_TEP_INT_RAW_V << MCPWM_TIMER0_TEP_INT_RAW_S)
#define MCPWM_TIMER0_TEP_INT_RAW_V  0x00000001U
#define MCPWM_TIMER0_TEP_INT_RAW_S  6
/** MCPWM_TIMER1_TEP_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM timer 1 TEP event.
 */
#define MCPWM_TIMER1_TEP_INT_RAW    (BIT(7))
#define MCPWM_TIMER1_TEP_INT_RAW_M  (MCPWM_TIMER1_TEP_INT_RAW_V << MCPWM_TIMER1_TEP_INT_RAW_S)
#define MCPWM_TIMER1_TEP_INT_RAW_V  0x00000001U
#define MCPWM_TIMER1_TEP_INT_RAW_S  7
/** MCPWM_TIMER2_TEP_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM timer 2 TEP event.
 */
#define MCPWM_TIMER2_TEP_INT_RAW    (BIT(8))
#define MCPWM_TIMER2_TEP_INT_RAW_M  (MCPWM_TIMER2_TEP_INT_RAW_V << MCPWM_TIMER2_TEP_INT_RAW_S)
#define MCPWM_TIMER2_TEP_INT_RAW_V  0x00000001U
#define MCPWM_TIMER2_TEP_INT_RAW_S  8
/** MCPWM_FAULT0_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw status bit for the interrupt triggered when fault_event0 starts.
 */
#define MCPWM_FAULT0_INT_RAW    (BIT(9))
#define MCPWM_FAULT0_INT_RAW_M  (MCPWM_FAULT0_INT_RAW_V << MCPWM_FAULT0_INT_RAW_S)
#define MCPWM_FAULT0_INT_RAW_V  0x00000001U
#define MCPWM_FAULT0_INT_RAW_S  9
/** MCPWM_FAULT1_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw status bit for the interrupt triggered when fault_event1 starts.
 */
#define MCPWM_FAULT1_INT_RAW    (BIT(10))
#define MCPWM_FAULT1_INT_RAW_M  (MCPWM_FAULT1_INT_RAW_V << MCPWM_FAULT1_INT_RAW_S)
#define MCPWM_FAULT1_INT_RAW_V  0x00000001U
#define MCPWM_FAULT1_INT_RAW_S  10
/** MCPWM_FAULT2_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw status bit for the interrupt triggered when fault_event2 starts.
 */
#define MCPWM_FAULT2_INT_RAW    (BIT(11))
#define MCPWM_FAULT2_INT_RAW_M  (MCPWM_FAULT2_INT_RAW_V << MCPWM_FAULT2_INT_RAW_S)
#define MCPWM_FAULT2_INT_RAW_V  0x00000001U
#define MCPWM_FAULT2_INT_RAW_S  11
/** MCPWM_FAULT0_CLR_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw status bit for the interrupt triggered when fault_event0 ends.
 */
#define MCPWM_FAULT0_CLR_INT_RAW    (BIT(12))
#define MCPWM_FAULT0_CLR_INT_RAW_M  (MCPWM_FAULT0_CLR_INT_RAW_V << MCPWM_FAULT0_CLR_INT_RAW_S)
#define MCPWM_FAULT0_CLR_INT_RAW_V  0x00000001U
#define MCPWM_FAULT0_CLR_INT_RAW_S  12
/** MCPWM_FAULT1_CLR_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  The raw status bit for the interrupt triggered when fault_event1 ends.
 */
#define MCPWM_FAULT1_CLR_INT_RAW    (BIT(13))
#define MCPWM_FAULT1_CLR_INT_RAW_M  (MCPWM_FAULT1_CLR_INT_RAW_V << MCPWM_FAULT1_CLR_INT_RAW_S)
#define MCPWM_FAULT1_CLR_INT_RAW_V  0x00000001U
#define MCPWM_FAULT1_CLR_INT_RAW_S  13
/** MCPWM_FAULT2_CLR_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 *  The raw status bit for the interrupt triggered when fault_event2 ends.
 */
#define MCPWM_FAULT2_CLR_INT_RAW    (BIT(14))
#define MCPWM_FAULT2_CLR_INT_RAW_M  (MCPWM_FAULT2_CLR_INT_RAW_V << MCPWM_FAULT2_CLR_INT_RAW_S)
#define MCPWM_FAULT2_CLR_INT_RAW_V  0x00000001U
#define MCPWM_FAULT2_CLR_INT_RAW_S  14
/** MCPWM_OP0_TEA_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM operator 0 TEA event
 */
#define MCPWM_OP0_TEA_INT_RAW    (BIT(15))
#define MCPWM_OP0_TEA_INT_RAW_M  (MCPWM_OP0_TEA_INT_RAW_V << MCPWM_OP0_TEA_INT_RAW_S)
#define MCPWM_OP0_TEA_INT_RAW_V  0x00000001U
#define MCPWM_OP0_TEA_INT_RAW_S  15
/** MCPWM_OP1_TEA_INT_RAW : R/WTC/SS; bitpos: [16]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM operator 1 TEA event
 */
#define MCPWM_OP1_TEA_INT_RAW    (BIT(16))
#define MCPWM_OP1_TEA_INT_RAW_M  (MCPWM_OP1_TEA_INT_RAW_V << MCPWM_OP1_TEA_INT_RAW_S)
#define MCPWM_OP1_TEA_INT_RAW_V  0x00000001U
#define MCPWM_OP1_TEA_INT_RAW_S  16
/** MCPWM_OP2_TEA_INT_RAW : R/WTC/SS; bitpos: [17]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM operator 2 TEA event
 */
#define MCPWM_OP2_TEA_INT_RAW    (BIT(17))
#define MCPWM_OP2_TEA_INT_RAW_M  (MCPWM_OP2_TEA_INT_RAW_V << MCPWM_OP2_TEA_INT_RAW_S)
#define MCPWM_OP2_TEA_INT_RAW_V  0x00000001U
#define MCPWM_OP2_TEA_INT_RAW_S  17
/** MCPWM_OP0_TEB_INT_RAW : R/WTC/SS; bitpos: [18]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM operator 0 TEB event
 */
#define MCPWM_OP0_TEB_INT_RAW    (BIT(18))
#define MCPWM_OP0_TEB_INT_RAW_M  (MCPWM_OP0_TEB_INT_RAW_V << MCPWM_OP0_TEB_INT_RAW_S)
#define MCPWM_OP0_TEB_INT_RAW_V  0x00000001U
#define MCPWM_OP0_TEB_INT_RAW_S  18
/** MCPWM_OP1_TEB_INT_RAW : R/WTC/SS; bitpos: [19]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM operator 1 TEB event
 */
#define MCPWM_OP1_TEB_INT_RAW    (BIT(19))
#define MCPWM_OP1_TEB_INT_RAW_M  (MCPWM_OP1_TEB_INT_RAW_V << MCPWM_OP1_TEB_INT_RAW_S)
#define MCPWM_OP1_TEB_INT_RAW_V  0x00000001U
#define MCPWM_OP1_TEB_INT_RAW_S  19
/** MCPWM_OP2_TEB_INT_RAW : R/WTC/SS; bitpos: [20]; default: 0;
 *  The raw status bit for the interrupt triggered by a PWM operator 2 TEB event
 */
#define MCPWM_OP2_TEB_INT_RAW    (BIT(20))
#define MCPWM_OP2_TEB_INT_RAW_M  (MCPWM_OP2_TEB_INT_RAW_V << MCPWM_OP2_TEB_INT_RAW_S)
#define MCPWM_OP2_TEB_INT_RAW_V  0x00000001U
#define MCPWM_OP2_TEB_INT_RAW_S  20
/** MCPWM_FH0_CBC_INT_RAW : R/WTC/SS; bitpos: [21]; default: 0;
 *  The raw status bit for the interrupt triggered by a cycle-by-cycle mode action on
 *  PWM0.
 */
#define MCPWM_FH0_CBC_INT_RAW    (BIT(21))
#define MCPWM_FH0_CBC_INT_RAW_M  (MCPWM_FH0_CBC_INT_RAW_V << MCPWM_FH0_CBC_INT_RAW_S)
#define MCPWM_FH0_CBC_INT_RAW_V  0x00000001U
#define MCPWM_FH0_CBC_INT_RAW_S  21
/** MCPWM_FH1_CBC_INT_RAW : R/WTC/SS; bitpos: [22]; default: 0;
 *  The raw status bit for the interrupt triggered by a cycle-by-cycle mode action on
 *  PWM1.
 */
#define MCPWM_FH1_CBC_INT_RAW    (BIT(22))
#define MCPWM_FH1_CBC_INT_RAW_M  (MCPWM_FH1_CBC_INT_RAW_V << MCPWM_FH1_CBC_INT_RAW_S)
#define MCPWM_FH1_CBC_INT_RAW_V  0x00000001U
#define MCPWM_FH1_CBC_INT_RAW_S  22
/** MCPWM_FH2_CBC_INT_RAW : R/WTC/SS; bitpos: [23]; default: 0;
 *  The raw status bit for the interrupt triggered by a cycle-by-cycle mode action on
 *  PWM2.
 */
#define MCPWM_FH2_CBC_INT_RAW    (BIT(23))
#define MCPWM_FH2_CBC_INT_RAW_M  (MCPWM_FH2_CBC_INT_RAW_V << MCPWM_FH2_CBC_INT_RAW_S)
#define MCPWM_FH2_CBC_INT_RAW_V  0x00000001U
#define MCPWM_FH2_CBC_INT_RAW_S  23
/** MCPWM_FH0_OST_INT_RAW : R/WTC/SS; bitpos: [24]; default: 0;
 *  The raw status bit for the interrupt triggered by a one-shot mode action on PWM0.
 */
#define MCPWM_FH0_OST_INT_RAW    (BIT(24))
#define MCPWM_FH0_OST_INT_RAW_M  (MCPWM_FH0_OST_INT_RAW_V << MCPWM_FH0_OST_INT_RAW_S)
#define MCPWM_FH0_OST_INT_RAW_V  0x00000001U
#define MCPWM_FH0_OST_INT_RAW_S  24
/** MCPWM_FH1_OST_INT_RAW : R/WTC/SS; bitpos: [25]; default: 0;
 *  The raw status bit for the interrupt triggered by a one-shot mode action on PWM1.
 */
#define MCPWM_FH1_OST_INT_RAW    (BIT(25))
#define MCPWM_FH1_OST_INT_RAW_M  (MCPWM_FH1_OST_INT_RAW_V << MCPWM_FH1_OST_INT_RAW_S)
#define MCPWM_FH1_OST_INT_RAW_V  0x00000001U
#define MCPWM_FH1_OST_INT_RAW_S  25
/** MCPWM_FH2_OST_INT_RAW : R/WTC/SS; bitpos: [26]; default: 0;
 *  The raw status bit for the interrupt triggered by a one-shot mode action on PWM2.
 */
#define MCPWM_FH2_OST_INT_RAW    (BIT(26))
#define MCPWM_FH2_OST_INT_RAW_M  (MCPWM_FH2_OST_INT_RAW_V << MCPWM_FH2_OST_INT_RAW_S)
#define MCPWM_FH2_OST_INT_RAW_V  0x00000001U
#define MCPWM_FH2_OST_INT_RAW_S  26
/** MCPWM_CAP0_INT_RAW : R/WTC/SS; bitpos: [27]; default: 0;
 *  The raw status bit for the interrupt triggered by capture on channel 0.
 */
#define MCPWM_CAP0_INT_RAW    (BIT(27))
#define MCPWM_CAP0_INT_RAW_M  (MCPWM_CAP0_INT_RAW_V << MCPWM_CAP0_INT_RAW_S)
#define MCPWM_CAP0_INT_RAW_V  0x00000001U
#define MCPWM_CAP0_INT_RAW_S  27
/** MCPWM_CAP1_INT_RAW : R/WTC/SS; bitpos: [28]; default: 0;
 *  The raw status bit for the interrupt triggered by capture on channel 1.
 */
#define MCPWM_CAP1_INT_RAW    (BIT(28))
#define MCPWM_CAP1_INT_RAW_M  (MCPWM_CAP1_INT_RAW_V << MCPWM_CAP1_INT_RAW_S)
#define MCPWM_CAP1_INT_RAW_V  0x00000001U
#define MCPWM_CAP1_INT_RAW_S  28
/** MCPWM_CAP2_INT_RAW : R/WTC/SS; bitpos: [29]; default: 0;
 *  The raw status bit for the interrupt triggered by capture on channel 2.
 */
#define MCPWM_CAP2_INT_RAW    (BIT(29))
#define MCPWM_CAP2_INT_RAW_M  (MCPWM_CAP2_INT_RAW_V << MCPWM_CAP2_INT_RAW_S)
#define MCPWM_CAP2_INT_RAW_V  0x00000001U
#define MCPWM_CAP2_INT_RAW_S  29

/** MCPWM_INT_ST_REG register
 *  Masked interrupt status
 */
#define MCPWM_INT_ST_REG(i) (DR_REG_MCPWM_BASE(i) + 0x118)
/** MCPWM_TIMER0_STOP_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked status bit for the interrupt triggered when the timer 0 stops.
 */
#define MCPWM_TIMER0_STOP_INT_ST    (BIT(0))
#define MCPWM_TIMER0_STOP_INT_ST_M  (MCPWM_TIMER0_STOP_INT_ST_V << MCPWM_TIMER0_STOP_INT_ST_S)
#define MCPWM_TIMER0_STOP_INT_ST_V  0x00000001U
#define MCPWM_TIMER0_STOP_INT_ST_S  0
/** MCPWM_TIMER1_STOP_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked status bit for the interrupt triggered when the timer 1 stops.
 */
#define MCPWM_TIMER1_STOP_INT_ST    (BIT(1))
#define MCPWM_TIMER1_STOP_INT_ST_M  (MCPWM_TIMER1_STOP_INT_ST_V << MCPWM_TIMER1_STOP_INT_ST_S)
#define MCPWM_TIMER1_STOP_INT_ST_V  0x00000001U
#define MCPWM_TIMER1_STOP_INT_ST_S  1
/** MCPWM_TIMER2_STOP_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked status bit for the interrupt triggered when the timer 2 stops.
 */
#define MCPWM_TIMER2_STOP_INT_ST    (BIT(2))
#define MCPWM_TIMER2_STOP_INT_ST_M  (MCPWM_TIMER2_STOP_INT_ST_V << MCPWM_TIMER2_STOP_INT_ST_S)
#define MCPWM_TIMER2_STOP_INT_ST_V  0x00000001U
#define MCPWM_TIMER2_STOP_INT_ST_S  2
/** MCPWM_TIMER0_TEZ_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM timer 0 TEZ event.
 */
#define MCPWM_TIMER0_TEZ_INT_ST    (BIT(3))
#define MCPWM_TIMER0_TEZ_INT_ST_M  (MCPWM_TIMER0_TEZ_INT_ST_V << MCPWM_TIMER0_TEZ_INT_ST_S)
#define MCPWM_TIMER0_TEZ_INT_ST_V  0x00000001U
#define MCPWM_TIMER0_TEZ_INT_ST_S  3
/** MCPWM_TIMER1_TEZ_INT_ST : RO; bitpos: [4]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM timer 1 TEZ event.
 */
#define MCPWM_TIMER1_TEZ_INT_ST    (BIT(4))
#define MCPWM_TIMER1_TEZ_INT_ST_M  (MCPWM_TIMER1_TEZ_INT_ST_V << MCPWM_TIMER1_TEZ_INT_ST_S)
#define MCPWM_TIMER1_TEZ_INT_ST_V  0x00000001U
#define MCPWM_TIMER1_TEZ_INT_ST_S  4
/** MCPWM_TIMER2_TEZ_INT_ST : RO; bitpos: [5]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM timer 2 TEZ event.
 */
#define MCPWM_TIMER2_TEZ_INT_ST    (BIT(5))
#define MCPWM_TIMER2_TEZ_INT_ST_M  (MCPWM_TIMER2_TEZ_INT_ST_V << MCPWM_TIMER2_TEZ_INT_ST_S)
#define MCPWM_TIMER2_TEZ_INT_ST_V  0x00000001U
#define MCPWM_TIMER2_TEZ_INT_ST_S  5
/** MCPWM_TIMER0_TEP_INT_ST : RO; bitpos: [6]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM timer 0 TEP event.
 */
#define MCPWM_TIMER0_TEP_INT_ST    (BIT(6))
#define MCPWM_TIMER0_TEP_INT_ST_M  (MCPWM_TIMER0_TEP_INT_ST_V << MCPWM_TIMER0_TEP_INT_ST_S)
#define MCPWM_TIMER0_TEP_INT_ST_V  0x00000001U
#define MCPWM_TIMER0_TEP_INT_ST_S  6
/** MCPWM_TIMER1_TEP_INT_ST : RO; bitpos: [7]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM timer 1 TEP event.
 */
#define MCPWM_TIMER1_TEP_INT_ST    (BIT(7))
#define MCPWM_TIMER1_TEP_INT_ST_M  (MCPWM_TIMER1_TEP_INT_ST_V << MCPWM_TIMER1_TEP_INT_ST_S)
#define MCPWM_TIMER1_TEP_INT_ST_V  0x00000001U
#define MCPWM_TIMER1_TEP_INT_ST_S  7
/** MCPWM_TIMER2_TEP_INT_ST : RO; bitpos: [8]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM timer 2 TEP event.
 */
#define MCPWM_TIMER2_TEP_INT_ST    (BIT(8))
#define MCPWM_TIMER2_TEP_INT_ST_M  (MCPWM_TIMER2_TEP_INT_ST_V << MCPWM_TIMER2_TEP_INT_ST_S)
#define MCPWM_TIMER2_TEP_INT_ST_V  0x00000001U
#define MCPWM_TIMER2_TEP_INT_ST_S  8
/** MCPWM_FAULT0_INT_ST : RO; bitpos: [9]; default: 0;
 *  The masked status bit for the interrupt triggered when fault_event0 starts.
 */
#define MCPWM_FAULT0_INT_ST    (BIT(9))
#define MCPWM_FAULT0_INT_ST_M  (MCPWM_FAULT0_INT_ST_V << MCPWM_FAULT0_INT_ST_S)
#define MCPWM_FAULT0_INT_ST_V  0x00000001U
#define MCPWM_FAULT0_INT_ST_S  9
/** MCPWM_FAULT1_INT_ST : RO; bitpos: [10]; default: 0;
 *  The masked status bit for the interrupt triggered when fault_event1 starts.
 */
#define MCPWM_FAULT1_INT_ST    (BIT(10))
#define MCPWM_FAULT1_INT_ST_M  (MCPWM_FAULT1_INT_ST_V << MCPWM_FAULT1_INT_ST_S)
#define MCPWM_FAULT1_INT_ST_V  0x00000001U
#define MCPWM_FAULT1_INT_ST_S  10
/** MCPWM_FAULT2_INT_ST : RO; bitpos: [11]; default: 0;
 *  The masked status bit for the interrupt triggered when fault_event2 starts.
 */
#define MCPWM_FAULT2_INT_ST    (BIT(11))
#define MCPWM_FAULT2_INT_ST_M  (MCPWM_FAULT2_INT_ST_V << MCPWM_FAULT2_INT_ST_S)
#define MCPWM_FAULT2_INT_ST_V  0x00000001U
#define MCPWM_FAULT2_INT_ST_S  11
/** MCPWM_FAULT0_CLR_INT_ST : RO; bitpos: [12]; default: 0;
 *  The masked status bit for the interrupt triggered when fault_event0 ends.
 */
#define MCPWM_FAULT0_CLR_INT_ST    (BIT(12))
#define MCPWM_FAULT0_CLR_INT_ST_M  (MCPWM_FAULT0_CLR_INT_ST_V << MCPWM_FAULT0_CLR_INT_ST_S)
#define MCPWM_FAULT0_CLR_INT_ST_V  0x00000001U
#define MCPWM_FAULT0_CLR_INT_ST_S  12
/** MCPWM_FAULT1_CLR_INT_ST : RO; bitpos: [13]; default: 0;
 *  The masked status bit for the interrupt triggered when fault_event1 ends.
 */
#define MCPWM_FAULT1_CLR_INT_ST    (BIT(13))
#define MCPWM_FAULT1_CLR_INT_ST_M  (MCPWM_FAULT1_CLR_INT_ST_V << MCPWM_FAULT1_CLR_INT_ST_S)
#define MCPWM_FAULT1_CLR_INT_ST_V  0x00000001U
#define MCPWM_FAULT1_CLR_INT_ST_S  13
/** MCPWM_FAULT2_CLR_INT_ST : RO; bitpos: [14]; default: 0;
 *  The masked status bit for the interrupt triggered when fault_event2 ends.
 */
#define MCPWM_FAULT2_CLR_INT_ST    (BIT(14))
#define MCPWM_FAULT2_CLR_INT_ST_M  (MCPWM_FAULT2_CLR_INT_ST_V << MCPWM_FAULT2_CLR_INT_ST_S)
#define MCPWM_FAULT2_CLR_INT_ST_V  0x00000001U
#define MCPWM_FAULT2_CLR_INT_ST_S  14
/** MCPWM_OP0_TEA_INT_ST : RO; bitpos: [15]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM operator 0 TEA event
 */
#define MCPWM_OP0_TEA_INT_ST    (BIT(15))
#define MCPWM_OP0_TEA_INT_ST_M  (MCPWM_OP0_TEA_INT_ST_V << MCPWM_OP0_TEA_INT_ST_S)
#define MCPWM_OP0_TEA_INT_ST_V  0x00000001U
#define MCPWM_OP0_TEA_INT_ST_S  15
/** MCPWM_OP1_TEA_INT_ST : RO; bitpos: [16]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM operator 1 TEA event
 */
#define MCPWM_OP1_TEA_INT_ST    (BIT(16))
#define MCPWM_OP1_TEA_INT_ST_M  (MCPWM_OP1_TEA_INT_ST_V << MCPWM_OP1_TEA_INT_ST_S)
#define MCPWM_OP1_TEA_INT_ST_V  0x00000001U
#define MCPWM_OP1_TEA_INT_ST_S  16
/** MCPWM_OP2_TEA_INT_ST : RO; bitpos: [17]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM operator 2 TEA event
 */
#define MCPWM_OP2_TEA_INT_ST    (BIT(17))
#define MCPWM_OP2_TEA_INT_ST_M  (MCPWM_OP2_TEA_INT_ST_V << MCPWM_OP2_TEA_INT_ST_S)
#define MCPWM_OP2_TEA_INT_ST_V  0x00000001U
#define MCPWM_OP2_TEA_INT_ST_S  17
/** MCPWM_OP0_TEB_INT_ST : RO; bitpos: [18]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM operator 0 TEB event
 */
#define MCPWM_OP0_TEB_INT_ST    (BIT(18))
#define MCPWM_OP0_TEB_INT_ST_M  (MCPWM_OP0_TEB_INT_ST_V << MCPWM_OP0_TEB_INT_ST_S)
#define MCPWM_OP0_TEB_INT_ST_V  0x00000001U
#define MCPWM_OP0_TEB_INT_ST_S  18
/** MCPWM_OP1_TEB_INT_ST : RO; bitpos: [19]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM operator 1 TEB event
 */
#define MCPWM_OP1_TEB_INT_ST    (BIT(19))
#define MCPWM_OP1_TEB_INT_ST_M  (MCPWM_OP1_TEB_INT_ST_V << MCPWM_OP1_TEB_INT_ST_S)
#define MCPWM_OP1_TEB_INT_ST_V  0x00000001U
#define MCPWM_OP1_TEB_INT_ST_S  19
/** MCPWM_OP2_TEB_INT_ST : RO; bitpos: [20]; default: 0;
 *  The masked status bit for the interrupt triggered by a PWM operator 2 TEB event
 */
#define MCPWM_OP2_TEB_INT_ST    (BIT(20))
#define MCPWM_OP2_TEB_INT_ST_M  (MCPWM_OP2_TEB_INT_ST_V << MCPWM_OP2_TEB_INT_ST_S)
#define MCPWM_OP2_TEB_INT_ST_V  0x00000001U
#define MCPWM_OP2_TEB_INT_ST_S  20
/** MCPWM_FH0_CBC_INT_ST : RO; bitpos: [21]; default: 0;
 *  The masked status bit for the interrupt triggered by a cycle-by-cycle mode action
 *  on PWM0.
 */
#define MCPWM_FH0_CBC_INT_ST    (BIT(21))
#define MCPWM_FH0_CBC_INT_ST_M  (MCPWM_FH0_CBC_INT_ST_V << MCPWM_FH0_CBC_INT_ST_S)
#define MCPWM_FH0_CBC_INT_ST_V  0x00000001U
#define MCPWM_FH0_CBC_INT_ST_S  21
/** MCPWM_FH1_CBC_INT_ST : RO; bitpos: [22]; default: 0;
 *  The masked status bit for the interrupt triggered by a cycle-by-cycle mode action
 *  on PWM1.
 */
#define MCPWM_FH1_CBC_INT_ST    (BIT(22))
#define MCPWM_FH1_CBC_INT_ST_M  (MCPWM_FH1_CBC_INT_ST_V << MCPWM_FH1_CBC_INT_ST_S)
#define MCPWM_FH1_CBC_INT_ST_V  0x00000001U
#define MCPWM_FH1_CBC_INT_ST_S  22
/** MCPWM_FH2_CBC_INT_ST : RO; bitpos: [23]; default: 0;
 *  The masked status bit for the interrupt triggered by a cycle-by-cycle mode action
 *  on PWM2.
 */
#define MCPWM_FH2_CBC_INT_ST    (BIT(23))
#define MCPWM_FH2_CBC_INT_ST_M  (MCPWM_FH2_CBC_INT_ST_V << MCPWM_FH2_CBC_INT_ST_S)
#define MCPWM_FH2_CBC_INT_ST_V  0x00000001U
#define MCPWM_FH2_CBC_INT_ST_S  23
/** MCPWM_FH0_OST_INT_ST : RO; bitpos: [24]; default: 0;
 *  The masked status bit for the interrupt triggered by a one-shot mode action on PWM0.
 */
#define MCPWM_FH0_OST_INT_ST    (BIT(24))
#define MCPWM_FH0_OST_INT_ST_M  (MCPWM_FH0_OST_INT_ST_V << MCPWM_FH0_OST_INT_ST_S)
#define MCPWM_FH0_OST_INT_ST_V  0x00000001U
#define MCPWM_FH0_OST_INT_ST_S  24
/** MCPWM_FH1_OST_INT_ST : RO; bitpos: [25]; default: 0;
 *  The masked status bit for the interrupt triggered by a one-shot mode action on PWM1.
 */
#define MCPWM_FH1_OST_INT_ST    (BIT(25))
#define MCPWM_FH1_OST_INT_ST_M  (MCPWM_FH1_OST_INT_ST_V << MCPWM_FH1_OST_INT_ST_S)
#define MCPWM_FH1_OST_INT_ST_V  0x00000001U
#define MCPWM_FH1_OST_INT_ST_S  25
/** MCPWM_FH2_OST_INT_ST : RO; bitpos: [26]; default: 0;
 *  The masked status bit for the interrupt triggered by a one-shot mode action on PWM2.
 */
#define MCPWM_FH2_OST_INT_ST    (BIT(26))
#define MCPWM_FH2_OST_INT_ST_M  (MCPWM_FH2_OST_INT_ST_V << MCPWM_FH2_OST_INT_ST_S)
#define MCPWM_FH2_OST_INT_ST_V  0x00000001U
#define MCPWM_FH2_OST_INT_ST_S  26
/** MCPWM_CAP0_INT_ST : RO; bitpos: [27]; default: 0;
 *  The masked status bit for the interrupt triggered by capture on channel 0.
 */
#define MCPWM_CAP0_INT_ST    (BIT(27))
#define MCPWM_CAP0_INT_ST_M  (MCPWM_CAP0_INT_ST_V << MCPWM_CAP0_INT_ST_S)
#define MCPWM_CAP0_INT_ST_V  0x00000001U
#define MCPWM_CAP0_INT_ST_S  27
/** MCPWM_CAP1_INT_ST : RO; bitpos: [28]; default: 0;
 *  The masked status bit for the interrupt triggered by capture on channel 1.
 */
#define MCPWM_CAP1_INT_ST    (BIT(28))
#define MCPWM_CAP1_INT_ST_M  (MCPWM_CAP1_INT_ST_V << MCPWM_CAP1_INT_ST_S)
#define MCPWM_CAP1_INT_ST_V  0x00000001U
#define MCPWM_CAP1_INT_ST_S  28
/** MCPWM_CAP2_INT_ST : RO; bitpos: [29]; default: 0;
 *  The masked status bit for the interrupt triggered by capture on channel 2.
 */
#define MCPWM_CAP2_INT_ST    (BIT(29))
#define MCPWM_CAP2_INT_ST_M  (MCPWM_CAP2_INT_ST_V << MCPWM_CAP2_INT_ST_S)
#define MCPWM_CAP2_INT_ST_V  0x00000001U
#define MCPWM_CAP2_INT_ST_S  29

