espressif/esp-idf/components/soc/esp32/register/soc/mcpwm_reg.h
/** MCPWM_INT_CLR_REG register
 *  Interrupt clear bits
 */
#define MCPWM_INT_CLR_REG(i) (DR_REG_MCPWM_BASE(i) + 0x11c)
/** MCPWM_TIMER0_STOP_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the interrupt triggered when the timer 0 stops.
 */
#define MCPWM_TIMER0_STOP_INT_CLR    (BIT(0))
#define MCPWM_TIMER0_STOP_INT_CLR_M  (MCPWM_TIMER0_STOP_INT_CLR_V << MCPWM_TIMER0_STOP_INT_CLR_S)
#define MCPWM_TIMER0_STOP_INT_CLR_V  0x00000001U
#define MCPWM_TIMER0_STOP_INT_CLR_S  0
/** MCPWM_TIMER1_STOP_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the interrupt triggered when the timer 1 stops.
 */
#define MCPWM_TIMER1_STOP_INT_CLR    (BIT(1))
#define MCPWM_TIMER1_STOP_INT_CLR_M  (MCPWM_TIMER1_STOP_INT_CLR_V << MCPWM_TIMER1_STOP_INT_CLR_S)
#define MCPWM_TIMER1_STOP_INT_CLR_V  0x00000001U
#define MCPWM_TIMER1_STOP_INT_CLR_S  1
/** MCPWM_TIMER2_STOP_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the interrupt triggered when the timer 2 stops.
 */
#define MCPWM_TIMER2_STOP_INT_CLR    (BIT(2))
#define MCPWM_TIMER2_STOP_INT_CLR_M  (MCPWM_TIMER2_STOP_INT_CLR_V << MCPWM_TIMER2_STOP_INT_CLR_S)
#define MCPWM_TIMER2_STOP_INT_CLR_V  0x00000001U
#define MCPWM_TIMER2_STOP_INT_CLR_S  2
/** MCPWM_TIMER0_TEZ_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM timer 0 TEZ event.
 */
#define MCPWM_TIMER0_TEZ_INT_CLR    (BIT(3))
#define MCPWM_TIMER0_TEZ_INT_CLR_M  (MCPWM_TIMER0_TEZ_INT_CLR_V << MCPWM_TIMER0_TEZ_INT_CLR_S)
#define MCPWM_TIMER0_TEZ_INT_CLR_V  0x00000001U
#define MCPWM_TIMER0_TEZ_INT_CLR_S  3
/** MCPWM_TIMER1_TEZ_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM timer 1 TEZ event.
 */
#define MCPWM_TIMER1_TEZ_INT_CLR    (BIT(4))
#define MCPWM_TIMER1_TEZ_INT_CLR_M  (MCPWM_TIMER1_TEZ_INT_CLR_V << MCPWM_TIMER1_TEZ_INT_CLR_S)
#define MCPWM_TIMER1_TEZ_INT_CLR_V  0x00000001U
#define MCPWM_TIMER1_TEZ_INT_CLR_S  4
/** MCPWM_TIMER2_TEZ_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM timer 2 TEZ event.
 */
#define MCPWM_TIMER2_TEZ_INT_CLR    (BIT(5))
#define MCPWM_TIMER2_TEZ_INT_CLR_M  (MCPWM_TIMER2_TEZ_INT_CLR_V << MCPWM_TIMER2_TEZ_INT_CLR_S)
#define MCPWM_TIMER2_TEZ_INT_CLR_V  0x00000001U
#define MCPWM_TIMER2_TEZ_INT_CLR_S  5
/** MCPWM_TIMER0_TEP_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM timer 0 TEP event.
 */
#define MCPWM_TIMER0_TEP_INT_CLR    (BIT(6))
#define MCPWM_TIMER0_TEP_INT_CLR_M  (MCPWM_TIMER0_TEP_INT_CLR_V << MCPWM_TIMER0_TEP_INT_CLR_S)
#define MCPWM_TIMER0_TEP_INT_CLR_V  0x00000001U
#define MCPWM_TIMER0_TEP_INT_CLR_S  6
/** MCPWM_TIMER1_TEP_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM timer 1 TEP event.
 */
#define MCPWM_TIMER1_TEP_INT_CLR    (BIT(7))
#define MCPWM_TIMER1_TEP_INT_CLR_M  (MCPWM_TIMER1_TEP_INT_CLR_V << MCPWM_TIMER1_TEP_INT_CLR_S)
#define MCPWM_TIMER1_TEP_INT_CLR_V  0x00000001U
#define MCPWM_TIMER1_TEP_INT_CLR_S  7
/** MCPWM_TIMER2_TEP_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM timer 2 TEP event.
 */
#define MCPWM_TIMER2_TEP_INT_CLR    (BIT(8))
#define MCPWM_TIMER2_TEP_INT_CLR_M  (MCPWM_TIMER2_TEP_INT_CLR_V << MCPWM_TIMER2_TEP_INT_CLR_S)
#define MCPWM_TIMER2_TEP_INT_CLR_V  0x00000001U
#define MCPWM_TIMER2_TEP_INT_CLR_S  8
/** MCPWM_FAULT0_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the interrupt triggered when fault_event0 starts.
 */
#define MCPWM_FAULT0_INT_CLR    (BIT(9))
#define MCPWM_FAULT0_INT_CLR_M  (MCPWM_FAULT0_INT_CLR_V << MCPWM_FAULT0_INT_CLR_S)
#define MCPWM_FAULT0_INT_CLR_V  0x00000001U
#define MCPWM_FAULT0_INT_CLR_S  9
/** MCPWM_FAULT1_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear the interrupt triggered when fault_event1 starts.
 */
#define MCPWM_FAULT1_INT_CLR    (BIT(10))
#define MCPWM_FAULT1_INT_CLR_M  (MCPWM_FAULT1_INT_CLR_V << MCPWM_FAULT1_INT_CLR_S)
#define MCPWM_FAULT1_INT_CLR_V  0x00000001U
#define MCPWM_FAULT1_INT_CLR_S  10
/** MCPWM_FAULT2_INT_CLR : WT; bitpos: [11]; default: 0;
 *  Set this bit to clear the interrupt triggered when fault_event2 starts.
 */
#define MCPWM_FAULT2_INT_CLR    (BIT(11))
#define MCPWM_FAULT2_INT_CLR_M  (MCPWM_FAULT2_INT_CLR_V << MCPWM_FAULT2_INT_CLR_S)
#define MCPWM_FAULT2_INT_CLR_V  0x00000001U
#define MCPWM_FAULT2_INT_CLR_S  11
/** MCPWM_FAULT0_CLR_INT_CLR : WT; bitpos: [12]; default: 0;
 *  Set this bit to clear the interrupt triggered when fault_event0 ends.
 */
#define MCPWM_FAULT0_CLR_INT_CLR    (BIT(12))
#define MCPWM_FAULT0_CLR_INT_CLR_M  (MCPWM_FAULT0_CLR_INT_CLR_V << MCPWM_FAULT0_CLR_INT_CLR_S)
#define MCPWM_FAULT0_CLR_INT_CLR_V  0x00000001U
#define MCPWM_FAULT0_CLR_INT_CLR_S  12
/** MCPWM_FAULT1_CLR_INT_CLR : WT; bitpos: [13]; default: 0;
 *  Set this bit to clear the interrupt triggered when fault_event1 ends.
 */
#define MCPWM_FAULT1_CLR_INT_CLR    (BIT(13))
#define MCPWM_FAULT1_CLR_INT_CLR_M  (MCPWM_FAULT1_CLR_INT_CLR_V << MCPWM_FAULT1_CLR_INT_CLR_S)
#define MCPWM_FAULT1_CLR_INT_CLR_V  0x00000001U
#define MCPWM_FAULT1_CLR_INT_CLR_S  13
/** MCPWM_FAULT2_CLR_INT_CLR : WT; bitpos: [14]; default: 0;
 *  Set this bit to clear the interrupt triggered when fault_event2 ends.
 */
#define MCPWM_FAULT2_CLR_INT_CLR    (BIT(14))
#define MCPWM_FAULT2_CLR_INT_CLR_M  (MCPWM_FAULT2_CLR_INT_CLR_V << MCPWM_FAULT2_CLR_INT_CLR_S)
#define MCPWM_FAULT2_CLR_INT_CLR_V  0x00000001U
#define MCPWM_FAULT2_CLR_INT_CLR_S  14
/** MCPWM_OP0_TEA_INT_CLR : WT; bitpos: [15]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM operator 0 TEA event
 */
#define MCPWM_OP0_TEA_INT_CLR    (BIT(15))
#define MCPWM_OP0_TEA_INT_CLR_M  (MCPWM_OP0_TEA_INT_CLR_V << MCPWM_OP0_TEA_INT_CLR_S)
#define MCPWM_OP0_TEA_INT_CLR_V  0x00000001U
#define MCPWM_OP0_TEA_INT_CLR_S  15
/** MCPWM_OP1_TEA_INT_CLR : WT; bitpos: [16]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM operator 1 TEA event
 */
#define MCPWM_OP1_TEA_INT_CLR    (BIT(16))
#define MCPWM_OP1_TEA_INT_CLR_M  (MCPWM_OP1_TEA_INT_CLR_V << MCPWM_OP1_TEA_INT_CLR_S)
#define MCPWM_OP1_TEA_INT_CLR_V  0x00000001U
#define MCPWM_OP1_TEA_INT_CLR_S  16
/** MCPWM_OP2_TEA_INT_CLR : WT; bitpos: [17]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM operator 2 TEA event
 */
#define MCPWM_OP2_TEA_INT_CLR    (BIT(17))
#define MCPWM_OP2_TEA_INT_CLR_M  (MCPWM_OP2_TEA_INT_CLR_V << MCPWM_OP2_TEA_INT_CLR_S)
#define MCPWM_OP2_TEA_INT_CLR_V  0x00000001U
#define MCPWM_OP2_TEA_INT_CLR_S  17
/** MCPWM_OP0_TEB_INT_CLR : WT; bitpos: [18]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM operator 0 TEB event
 */
#define MCPWM_OP0_TEB_INT_CLR    (BIT(18))
#define MCPWM_OP0_TEB_INT_CLR_M  (MCPWM_OP0_TEB_INT_CLR_V << MCPWM_OP0_TEB_INT_CLR_S)
#define MCPWM_OP0_TEB_INT_CLR_V  0x00000001U
#define MCPWM_OP0_TEB_INT_CLR_S  18
/** MCPWM_OP1_TEB_INT_CLR : WT; bitpos: [19]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM operator 1 TEB event
 */
#define MCPWM_OP1_TEB_INT_CLR    (BIT(19))
#define MCPWM_OP1_TEB_INT_CLR_M  (MCPWM_OP1_TEB_INT_CLR_V << MCPWM_OP1_TEB_INT_CLR_S)
#define MCPWM_OP1_TEB_INT_CLR_V  0x00000001U
#define MCPWM_OP1_TEB_INT_CLR_S  19
/** MCPWM_OP2_TEB_INT_CLR : WT; bitpos: [20]; default: 0;
 *  Set this bit to clear the interrupt triggered by a PWM operator 2 TEB event
 */
#define MCPWM_OP2_TEB_INT_CLR    (BIT(20))
#define MCPWM_OP2_TEB_INT_CLR_M  (MCPWM_OP2_TEB_INT_CLR_V << MCPWM_OP2_TEB_INT_CLR_S)
#define MCPWM_OP2_TEB_INT_CLR_V  0x00000001U
#define MCPWM_OP2_TEB_INT_CLR_S  20
/** MCPWM_FH0_CBC_INT_CLR : WT; bitpos: [21]; default: 0;
 *  Set this bit to clear the interrupt triggered by a cycle-by-cycle mode action on
 *  PWM0.
 */
#define MCPWM_FH0_CBC_INT_CLR    (BIT(21))
#define MCPWM_FH0_CBC_INT_CLR_M  (MCPWM_FH0_CBC_INT_CLR_V << MCPWM_FH0_CBC_INT_CLR_S)
#define MCPWM_FH0_CBC_INT_CLR_V  0x00000001U
#define MCPWM_FH0_CBC_INT_CLR_S  21
/** MCPWM_FH1_CBC_INT_CLR : WT; bitpos: [22]; default: 0;
 *  Set this bit to clear the interrupt triggered by a cycle-by-cycle mode action on
 *  PWM1.
 */
#define MCPWM_FH1_CBC_INT_CLR    (BIT(22))
#define MCPWM_FH1_CBC_INT_CLR_M  (MCPWM_FH1_CBC_INT_CLR_V << MCPWM_FH1_CBC_INT_CLR_S)
#define MCPWM_FH1_CBC_INT_CLR_V  0x00000001U
#define MCPWM_FH1_CBC_INT_CLR_S  22
/** MCPWM_FH2_CBC_INT_CLR : WT; bitpos: [23]; default: 0;
 *  Set this bit to clear the interrupt triggered by a cycle-by-cycle mode action on
 *  PWM2.
 */
#define MCPWM_FH2_CBC_INT_CLR    (BIT(23))
#define MCPWM_FH2_CBC_INT_CLR_M  (MCPWM_FH2_CBC_INT_CLR_V << MCPWM_FH2_CBC_INT_CLR_S)
#define MCPWM_FH2_CBC_INT_CLR_V  0x00000001U
#define MCPWM_FH2_CBC_INT_CLR_S  23
/** MCPWM_FH0_OST_INT_CLR : WT; bitpos: [24]; default: 0;
 *  Set this bit to clear the interrupt triggered by a one-shot mode action on PWM0.
 */
#define MCPWM_FH0_OST_INT_CLR    (BIT(24))
#define MCPWM_FH0_OST_INT_CLR_M  (MCPWM_FH0_OST_INT_CLR_V << MCPWM_FH0_OST_INT_CLR_S)
#define MCPWM_FH0_OST_INT_CLR_V  0x00000001U
#define MCPWM_FH0_OST_INT_CLR_S  24
/** MCPWM_FH1_OST_INT_CLR : WT; bitpos: [25]; default: 0;
 *  Set this bit to clear the interrupt triggered by a one-shot mode action on PWM1.
 */
#define MCPWM_FH1_OST_INT_CLR    (BIT(25))
#define MCPWM_FH1_OST_INT_CLR_M  (MCPWM_FH1_OST_INT_CLR_V << MCPWM_FH1_OST_INT_CLR_S)
#define MCPWM_FH1_OST_INT_CLR_V  0x00000001U
#define MCPWM_FH1_OST_INT_CLR_S  25
/** MCPWM_FH2_OST_INT_CLR : WT; bitpos: [26]; default: 0;
 *  Set this bit to clear the interrupt triggered by a one-shot mode action on PWM2.
 */
#define MCPWM_FH2_OST_INT_CLR    (BIT(26))
#define MCPWM_FH2_OST_INT_CLR_M  (MCPWM_FH2_OST_INT_CLR_V << MCPWM_FH2_OST_INT_CLR_S)
#define MCPWM_FH2_OST_INT_CLR_V  0x00000001U
#define MCPWM_FH2_OST_INT_CLR_S  26
/** MCPWM_CAP0_INT_CLR : WT; bitpos: [27]; default: 0;
 *  Set this bit to clear the interrupt triggered by capture on channel 0.
 */
#define MCPWM_CAP0_INT_CLR    (BIT(27))
#define MCPWM_CAP0_INT_CLR_M  (MCPWM_CAP0_INT_CLR_V << MCPWM_CAP0_INT_CLR_S)
#define MCPWM_CAP0_INT_CLR_V  0x00000001U
#define MCPWM_CAP0_INT_CLR_S  27
/** MCPWM_CAP1_INT_CLR : WT; bitpos: [28]; default: 0;
 *  Set this bit to clear the interrupt triggered by capture on channel 1.
 */
#define MCPWM_CAP1_INT_CLR    (BIT(28))
#define MCPWM_CAP1_INT_CLR_M  (MCPWM_CAP1_INT_CLR_V << MCPWM_CAP1_INT_CLR_S)
#define MCPWM_CAP1_INT_CLR_V  0x00000001U
#define MCPWM_CAP1_INT_CLR_S  28
/** MCPWM_CAP2_INT_CLR : WT; bitpos: [29]; default: 0;
 *  Set this bit to clear the interrupt triggered by capture on channel 2.
 */
#define MCPWM_CAP2_INT_CLR    (BIT(29))
#define MCPWM_CAP2_INT_CLR_M  (MCPWM_CAP2_INT_CLR_V << MCPWM_CAP2_INT_CLR_S)
#define MCPWM_CAP2_INT_CLR_V  0x00000001U
#define MCPWM_CAP2_INT_CLR_S  29

/** MCPWM_CLK_REG register
 *  MCPWM APB configuration register
 */
#define MCPWM_CLK_REG(i) (DR_REG_MCPWM_BASE(i) + 0x120)
/** MCPWM_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Force clock on for this register file
 */
#define MCPWM_CLK_EN    (BIT(0))
#define MCPWM_CLK_EN_M  (MCPWM_CLK_EN_V << MCPWM_CLK_EN_S)
#define MCPWM_CLK_EN_V  0x00000001U
#define MCPWM_CLK_EN_S  0

/** MCPWM_VERSION_REG register
 *  Version register.
 */
#define MCPWM_VERSION_REG(i) (DR_REG_MCPWM_BASE(i) + 0x124)
/** MCPWM_DATE : R/W; bitpos: [27:0]; default: 34632240;
 *  Version of this register file
 */
#define MCPWM_DATE    0x0FFFFFFFU
#define MCPWM_DATE_M  (MCPWM_DATE_V << MCPWM_DATE_S)
#define MCPWM_DATE_V  0x0FFFFFFFU
#define MCPWM_DATE_S  0

#ifdef __cplusplus
}
#endif
